; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p17---int100n150-m25---int100c200---s469---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 - fuellevel
)

(:init
(sum level0 level6 level6)
(sum level0 level9 level9)
(sum level1 level6 level7)
(sum level1 level9 level10)
(sum level2 level6 level8)
(sum level2 level9 level11)
(sum level3 level6 level9)
(sum level3 level9 level12)
(sum level4 level6 level10)
(sum level4 level9 level13)
(sum level5 level6 level11)
(sum level5 level9 level14)
(sum level6 level6 level12)
(sum level6 level9 level15)
(sum level7 level6 level13)
(sum level7 level9 level16)
(sum level8 level6 level14)
(sum level8 level9 level17)
(sum level9 level6 level15)
(sum level9 level9 level18)
(sum level10 level6 level16)
(sum level10 level9 level19)
(sum level11 level6 level17)
(sum level11 level9 level20)
(sum level12 level6 level18)
(sum level12 level9 level21)
(sum level13 level6 level19)
(sum level13 level9 level22)
(sum level14 level6 level20)
(sum level14 level9 level23)
(sum level15 level6 level21)
(sum level15 level9 level24)
(sum level16 level6 level22)
(sum level16 level9 level25)
(sum level17 level6 level23)
(sum level17 level9 level26)
(sum level18 level6 level24)
(sum level18 level9 level27)
(sum level19 level6 level25)
(sum level19 level9 level28)
(sum level20 level6 level26)
(sum level20 level9 level29)
(sum level21 level6 level27)
(sum level21 level9 level30)
(sum level22 level6 level28)
(sum level22 level9 level31)
(sum level23 level6 level29)
(sum level23 level9 level32)
(sum level24 level6 level30)
(sum level24 level9 level33)
(sum level25 level6 level31)
(sum level25 level9 level34)
(sum level26 level6 level32)
(sum level26 level9 level35)
(sum level27 level6 level33)
(sum level27 level9 level36)
(sum level28 level6 level34)
(sum level28 level9 level37)
(sum level29 level6 level35)
(sum level29 level9 level38)
(sum level30 level6 level36)
(sum level30 level9 level39)
(sum level31 level6 level37)
(sum level31 level9 level40)
(sum level32 level6 level38)
(sum level32 level9 level41)
(sum level33 level6 level39)
(sum level33 level9 level42)
(sum level34 level6 level40)
(sum level34 level9 level43)
(sum level35 level6 level41)
(sum level35 level9 level44)
(sum level36 level6 level42)
(sum level36 level9 level45)
(sum level37 level6 level43)
(sum level37 level9 level46)
(sum level38 level6 level44)
(sum level38 level9 level47)
(sum level39 level6 level45)
(sum level39 level9 level48)
(sum level40 level6 level46)
(sum level40 level9 level49)
(sum level41 level6 level47)
(sum level41 level9 level50)
(sum level42 level6 level48)
(sum level42 level9 level51)
(sum level43 level6 level49)
(sum level43 level9 level52)
(sum level44 level6 level50)
(sum level44 level9 level53)
(sum level45 level6 level51)
(sum level45 level9 level54)
(sum level46 level6 level52)
(sum level46 level9 level55)
(sum level47 level6 level53)
(sum level47 level9 level56)
(sum level48 level6 level54)
(sum level48 level9 level57)
(sum level49 level6 level55)
(sum level49 level9 level58)
(sum level50 level6 level56)
(sum level50 level9 level59)
(sum level51 level6 level57)
(sum level51 level9 level60)
(sum level52 level6 level58)
(sum level53 level6 level59)
(sum level54 level6 level60)

(connected l0 l1)
(fuelcost level9 l0 l1)
(connected l0 l2)
(fuelcost level9 l0 l2)
(connected l1 l0)
(fuelcost level9 l1 l0)
(connected l1 l2)
(fuelcost level6 l1 l2)
(connected l2 l0)
(fuelcost level9 l2 l0)
(connected l2 l1)
(fuelcost level6 l2 l1)

(at t0 l2)
(fuel t0 level60)
(= (total-cost) 0)

(at p0 l1)
(at p1 l0)
(at p2 l0)
(at p3 l0)
(at p4 l1)
(at p5 l2)
(at p6 l1)
(at p7 l0)
(at p8 l2)
(at p9 l0)
(at p10 l1)
(at p11 l1)
(at p12 l1)
(at p13 l1)
(at p14 l1)
(at p15 l1)
(at p16 l0)
)

(:goal
(and
(at p0 l2)
(at p1 l1)
(at p2 l2)
(at p3 l1)
(at p4 l2)
(at p5 l1)
(at p6 l2)
(at p7 l1)
(at p8 l1)
(at p9 l2)
(at p10 l2)
(at p11 l2)
(at p12 l0)
(at p13 l2)
(at p14 l2)
(at p15 l2)
(at p16 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l2 l1 level54 level6 level60)
   deleted: (at t0 l2) (fuel t0 level60)
   added: (at t0 l1) (fuel t0 level54)
   goals met: 0 of 17
2. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 0 of 17
3. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 17
4. (load p15 t0 l1)
   deleted: (at p15 l1)
   added: (in p15 t0)
   goals met: 0 of 17
5. (load p14 t0 l1)
   deleted: (at p14 l1)
   added: (in p14 t0)
   goals met: 0 of 17
6. (load p13 t0 l1)
   deleted: (at p13 l1)
   added: (in p13 t0)
   goals met: 0 of 17
7. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 0 of 17
8. (load p11 t0 l1)
   deleted: (at p11 l1)
   added: (in p11 t0)
   goals met: 0 of 17
9. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 0 of 17
10. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 0 of 17
11. (drive t0 l1 l0 level45 level9 level54)
   deleted: (at t0 l1) (fuel t0 level54)
   added: (at t0 l0) (fuel t0 level45)
   goals met: 0 of 17
12. (unload p12 t0 l0)
   deleted: (in p12 t0)
   added: (at p12 l0)
   goals met: 1 of 17
13. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 1 of 17
14. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 1 of 17
15. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 1 of 17
16. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 1 of 17
17. (load p16 t0 l0)
   deleted: (at p16 l0)
   added: (in p16 t0)
   goals met: 1 of 17
18. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 1 of 17
19. (drive t0 l0 l2 level36 level9 level45)
   deleted: (at t0 l0) (fuel t0 level45)
   added: (at t0 l2) (fuel t0 level36)
   goals met: 1 of 17
20. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 2 of 17
21. (unload p16 t0 l2)
   deleted: (in p16 t0)
   added: (at p16 l2)
   goals met: 3 of 17
22. (unload p15 t0 l2)
   deleted: (in p15 t0)
   added: (at p15 l2)
   goals met: 4 of 17
23. (unload p14 t0 l2)
   deleted: (in p14 t0)
   added: (at p14 l2)
   goals met: 5 of 17
24. (unload p13 t0 l2)
   deleted: (in p13 t0)
   added: (at p13 l2)
   goals met: 6 of 17
25. (unload p11 t0 l2)
   deleted: (in p11 t0)
   added: (at p11 l2)
   goals met: 7 of 17
26. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 8 of 17
27. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 9 of 17
28. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 9 of 17
29. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 9 of 17
30. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 10 of 17
31. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 11 of 17
32. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 12 of 17
33. (drive t0 l2 l1 level30 level6 level36)
   deleted: (at t0 l2) (fuel t0 level36)
   added: (at t0 l1) (fuel t0 level30)
   goals met: 12 of 17
34. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 13 of 17
35. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 14 of 17
36. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 15 of 17
37. (unload p7 t0 l1)
   deleted: (in p7 t0)
   added: (at p7 l1)
   goals met: 16 of 17
38. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 17 of 17
